MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F16KM204/mcu.h
#define _IPC4_CMIP2_POSITION                     0x0000000A
#define _IPC4_CMIP2_MASK                         0x00000400
#define _IPC4_CMIP2_LENGTH                       0x00000001

#define _IPC4_CNIP0_POSITION                     0x0000000C
#define _IPC4_CNIP0_MASK                         0x00001000
#define _IPC4_CNIP0_LENGTH                       0x00000001

#define _IPC4_CNIP1_POSITION                     0x0000000D
#define _IPC4_CNIP1_MASK                         0x00002000
#define _IPC4_CNIP1_LENGTH                       0x00000001

#define _IPC4_CNIP2_POSITION                     0x0000000E
#define _IPC4_CNIP2_MASK                         0x00004000
#define _IPC4_CNIP2_LENGTH                       0x00000001

#define _IPC5_INT1IP_POSITION                    0x00000000
#define _IPC5_INT1IP_MASK                        0x00000007
#define _IPC5_INT1IP_LENGTH                      0x00000003

#define _IPC5_CCP5IP_POSITION                    0x00000008
#define _IPC5_CCP5IP_MASK                        0x00000700
#define _IPC5_CCP5IP_LENGTH                      0x00000003

#define _IPC5_INT1IP0_POSITION                   0x00000000
#define _IPC5_INT1IP0_MASK                       0x00000001
#define _IPC5_INT1IP0_LENGTH                     0x00000001

#define _IPC5_INT1IP1_POSITION                   0x00000001
#define _IPC5_INT1IP1_MASK                       0x00000002
#define _IPC5_INT1IP1_LENGTH                     0x00000001

#define _IPC5_INT1IP2_POSITION                   0x00000002
#define _IPC5_INT1IP2_MASK                       0x00000004
#define _IPC5_INT1IP2_LENGTH                     0x00000001

#define _IPC5_CCP5IP0_POSITION                   0x00000008
#define _IPC5_CCP5IP0_MASK                       0x00000100
#define _IPC5_CCP5IP0_LENGTH                     0x00000001

#define _IPC5_CCP5IP1_POSITION                   0x00000009
#define _IPC5_CCP5IP1_MASK                       0x00000200
#define _IPC5_CCP5IP1_LENGTH                     0x00000001

#define _IPC5_CCP5IP2_POSITION                   0x0000000A
#define _IPC5_CCP5IP2_MASK                       0x00000400
#define _IPC5_CCP5IP2_LENGTH                     0x00000001

#define _IPC6_CCT3IP_POSITION                    0x0000000C
#define _IPC6_CCT3IP_MASK                        0x00007000
#define _IPC6_CCT3IP_LENGTH                      0x00000003

#define _IPC6_CCT3IP0_POSITION                   0x0000000C
#define _IPC6_CCT3IP0_MASK                       0x00001000
#define _IPC6_CCT3IP0_LENGTH                     0x00000001

#define _IPC6_CCT3IP1_POSITION                   0x0000000D
#define _IPC6_CCT3IP1_MASK                       0x00002000
#define _IPC6_CCT3IP1_LENGTH                     0x00000001

#define _IPC6_CCT3IP2_POSITION                   0x0000000E
#define _IPC6_CCT3IP2_MASK                       0x00004000
#define _IPC6_CCT3IP2_LENGTH                     0x00000001

#define _IPC7_CCT4IP_POSITION                    0x00000000
#define _IPC7_CCT4IP_MASK                        0x00000007
#define _IPC7_CCT4IP_LENGTH                      0x00000003

#define _IPC7_INT2IP_POSITION                    0x00000004
#define _IPC7_INT2IP_MASK                        0x00000070
#define _IPC7_INT2IP_LENGTH                      0x00000003

#define _IPC7_U2RXIP_POSITION                    0x00000008
#define _IPC7_U2RXIP_MASK                        0x00000700
#define _IPC7_U2RXIP_LENGTH                      0x00000003

#define _IPC7_U2TXIP_POSITION                    0x0000000C
#define _IPC7_U2TXIP_MASK                        0x00007000
#define _IPC7_U2TXIP_LENGTH                      0x00000003

#define _IPC7_CCT4IP0_POSITION                   0x00000000
#define _IPC7_CCT4IP0_MASK                       0x00000001
#define _IPC7_CCT4IP0_LENGTH                     0x00000001

#define _IPC7_CCT4IP1_POSITION                   0x00000001
#define _IPC7_CCT4IP1_MASK                       0x00000002
#define _IPC7_CCT4IP1_LENGTH                     0x00000001

#define _IPC7_CCT4IP2_POSITION                   0x00000002
#define _IPC7_CCT4IP2_MASK                       0x00000004
#define _IPC7_CCT4IP2_LENGTH                     0x00000001

#define _IPC7_INT2IP0_POSITION                   0x00000004
#define _IPC7_INT2IP0_MASK                       0x00000010
#define _IPC7_INT2IP0_LENGTH                     0x00000001

#define _IPC7_INT2IP1_POSITION                   0x00000005
#define _IPC7_INT2IP1_MASK                       0x00000020
#define _IPC7_INT2IP1_LENGTH                     0x00000001

#define _IPC7_INT2IP2_POSITION                   0x00000006
#define _IPC7_INT2IP2_MASK                       0x00000040
#define _IPC7_INT2IP2_LENGTH                     0x00000001

#define _IPC7_U2RXIP0_POSITION                   0x00000008
#define _IPC7_U2RXIP0_MASK                       0x00000100
#define _IPC7_U2RXIP0_LENGTH                     0x00000001

#define _IPC7_U2RXIP1_POSITION                   0x00000009
#define _IPC7_U2RXIP1_MASK                       0x00000200
#define _IPC7_U2RXIP1_LENGTH                     0x00000001

#define _IPC7_U2RXIP2_POSITION                   0x0000000A
#define _IPC7_U2RXIP2_MASK                       0x00000400
#define _IPC7_U2RXIP2_LENGTH                     0x00000001

#define _IPC7_U2TXIP0_POSITION                   0x0000000C
#define _IPC7_U2TXIP0_MASK                       0x00001000
#define _IPC7_U2TXIP0_LENGTH                     0x00000001

#define _IPC7_U2TXIP1_POSITION                   0x0000000D
#define _IPC7_U2TXIP1_MASK                       0x00002000
#define _IPC7_U2TXIP1_LENGTH                     0x00000001

#define _IPC7_U2TXIP2_POSITION                   0x0000000E
#define _IPC7_U2TXIP2_MASK                       0x00004000
#define _IPC7_U2TXIP2_LENGTH                     0x00000001

#define _IPC10_CCT5IP_POSITION                   0x00000004
#define _IPC10_CCT5IP_MASK                       0x00000070
#define _IPC10_CCT5IP_LENGTH                     0x00000003

#define _IPC10_CCT5IP0_POSITION                  0x00000004
#define _IPC10_CCT5IP0_MASK                      0x00000010
#define _IPC10_CCT5IP0_LENGTH                    0x00000001

#define _IPC10_CCT5IP1_POSITION                  0x00000005
#define _IPC10_CCT5IP1_MASK                      0x00000020
#define _IPC10_CCT5IP1_LENGTH                    0x00000001

#define _IPC10_CCT5IP2_POSITION                  0x00000006
#define _IPC10_CCT5IP2_MASK                      0x00000040
#define _IPC10_CCT5IP2_LENGTH                    0x00000001

#define _IPC12_SSP2IP_POSITION                   0x00000004
#define _IPC12_SSP2IP_MASK                       0x00000070
#define _IPC12_SSP2IP_LENGTH                     0x00000003

#define _IPC12_BCL2IP_POSITION                   0x00000008
#define _IPC12_BCL2IP_MASK                       0x00000700
#define _IPC12_BCL2IP_LENGTH                     0x00000003

#define _IPC12_SSP2IP0_POSITION                  0x00000004
#define _IPC12_SSP2IP0_MASK                      0x00000010
#define _IPC12_SSP2IP0_LENGTH                    0x00000001

#define _IPC12_SSP2IP1_POSITION                  0x00000005
#define _IPC12_SSP2IP1_MASK                      0x00000020
#define _IPC12_SSP2IP1_LENGTH                    0x00000001

#define _IPC12_SSP2IP2_POSITION                  0x00000006
#define _IPC12_SSP2IP2_MASK                      0x00000040
#define _IPC12_SSP2IP2_LENGTH                    0x00000001

#define _IPC12_BCL2IP0_POSITION                  0x00000008
#define _IPC12_BCL2IP0_MASK                      0x00000100
#define _IPC12_BCL2IP0_LENGTH                    0x00000001

#define _IPC12_BCL2IP1_POSITION                  0x00000009
#define _IPC12_BCL2IP1_MASK                      0x00000200
#define _IPC12_BCL2IP1_LENGTH                    0x00000001

