MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F16KM204/mcu.h
#define _DAC2CON_DACOE_POSITION                  0x00000007
#define _DAC2CON_DACOE_MASK                      0x00000080
#define _DAC2CON_DACOE_LENGTH                    0x00000001

#define _DAC2CON_DACTRIG_POSITION                0x00000008
#define _DAC2CON_DACTRIG_MASK                    0x00000100
#define _DAC2CON_DACTRIG_LENGTH                  0x00000001

#define _DAC2CON_SRDIS_POSITION                  0x00000009
#define _DAC2CON_SRDIS_MASK                      0x00000200
#define _DAC2CON_SRDIS_LENGTH                    0x00000001

#define _DAC2CON_DACFM_POSITION                  0x0000000B
#define _DAC2CON_DACFM_MASK                      0x00000800
#define _DAC2CON_DACFM_LENGTH                    0x00000001

#define _DAC2CON_DACSLP_POSITION                 0x0000000C
#define _DAC2CON_DACSLP_MASK                     0x00001000
#define _DAC2CON_DACSLP_LENGTH                   0x00000001

#define _DAC2CON_DACSIDL_POSITION                0x0000000D
#define _DAC2CON_DACSIDL_MASK                    0x00002000
#define _DAC2CON_DACSIDL_LENGTH                  0x00000001

#define _DAC2CON_DACEN_POSITION                  0x0000000F
#define _DAC2CON_DACEN_MASK                      0x00008000
#define _DAC2CON_DACEN_LENGTH                    0x00000001

#define _DAC2CON_REFSEL0_POSITION                0x00000000
#define _DAC2CON_REFSEL0_MASK                    0x00000001
#define _DAC2CON_REFSEL0_LENGTH                  0x00000001

#define _DAC2CON_REFSEL1_POSITION                0x00000001
#define _DAC2CON_REFSEL1_MASK                    0x00000002
#define _DAC2CON_REFSEL1_LENGTH                  0x00000001

#define _DAC2CON_DACTSEL0_POSITION               0x00000002
#define _DAC2CON_DACTSEL0_MASK                   0x00000004
#define _DAC2CON_DACTSEL0_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL1_POSITION               0x00000003
#define _DAC2CON_DACTSEL1_MASK                   0x00000008
#define _DAC2CON_DACTSEL1_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL2_POSITION               0x00000004
#define _DAC2CON_DACTSEL2_MASK                   0x00000010
#define _DAC2CON_DACTSEL2_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL3_POSITION               0x00000005
#define _DAC2CON_DACTSEL3_MASK                   0x00000020
#define _DAC2CON_DACTSEL3_LENGTH                 0x00000001

#define _DAC2CON_DACTSEL4_POSITION               0x00000006
#define _DAC2CON_DACTSEL4_MASK                   0x00000040
#define _DAC2CON_DACTSEL4_LENGTH                 0x00000001

#define _TRISA_TRISA0_POSITION                   0x00000000
#define _TRISA_TRISA0_MASK                       0x00000001
#define _TRISA_TRISA0_LENGTH                     0x00000001

#define _TRISA_TRISA1_POSITION                   0x00000001
#define _TRISA_TRISA1_MASK                       0x00000002
#define _TRISA_TRISA1_LENGTH                     0x00000001

#define _TRISA_TRISA2_POSITION                   0x00000002
#define _TRISA_TRISA2_MASK                       0x00000004
#define _TRISA_TRISA2_LENGTH                     0x00000001

#define _TRISA_TRISA3_POSITION                   0x00000003
#define _TRISA_TRISA3_MASK                       0x00000008
#define _TRISA_TRISA3_LENGTH                     0x00000001

#define _TRISA_TRISA4_POSITION                   0x00000004
#define _TRISA_TRISA4_MASK                       0x00000010
#define _TRISA_TRISA4_LENGTH                     0x00000001

#define _TRISA_TRISA6_POSITION                   0x00000006
#define _TRISA_TRISA6_MASK                       0x00000040
#define _TRISA_TRISA6_LENGTH                     0x00000001

#define _TRISA_TRISA7_POSITION                   0x00000007
#define _TRISA_TRISA7_MASK                       0x00000080
#define _TRISA_TRISA7_LENGTH                     0x00000001

#define _TRISA_TRISA8_POSITION                   0x00000008
#define _TRISA_TRISA8_MASK                       0x00000100
#define _TRISA_TRISA8_LENGTH                     0x00000001

#define _TRISA_TRISA9_POSITION                   0x00000009
#define _TRISA_TRISA9_MASK                       0x00000200
#define _TRISA_TRISA9_LENGTH                     0x00000001

#define _TRISA_TRISA10_POSITION                  0x0000000A
#define _TRISA_TRISA10_MASK                      0x00000400
#define _TRISA_TRISA10_LENGTH                    0x00000001

#define _TRISA_TRISA11_POSITION                  0x0000000B
#define _TRISA_TRISA11_MASK                      0x00000800
#define _TRISA_TRISA11_LENGTH                    0x00000001

#define _PORTA_RA0_POSITION                      0x00000000
#define _PORTA_RA0_MASK                          0x00000001
#define _PORTA_RA0_LENGTH                        0x00000001

#define _PORTA_RA1_POSITION                      0x00000001
#define _PORTA_RA1_MASK                          0x00000002
#define _PORTA_RA1_LENGTH                        0x00000001

#define _PORTA_RA2_POSITION                      0x00000002
#define _PORTA_RA2_MASK                          0x00000004
#define _PORTA_RA2_LENGTH                        0x00000001

#define _PORTA_RA3_POSITION                      0x00000003
#define _PORTA_RA3_MASK                          0x00000008
#define _PORTA_RA3_LENGTH                        0x00000001

#define _PORTA_RA4_POSITION                      0x00000004
#define _PORTA_RA4_MASK                          0x00000010
#define _PORTA_RA4_LENGTH                        0x00000001

#define _PORTA_RA5_POSITION                      0x00000005
#define _PORTA_RA5_MASK                          0x00000020
#define _PORTA_RA5_LENGTH                        0x00000001

#define _PORTA_RA6_POSITION                      0x00000006
#define _PORTA_RA6_MASK                          0x00000040
#define _PORTA_RA6_LENGTH                        0x00000001

#define _PORTA_RA7_POSITION                      0x00000007
#define _PORTA_RA7_MASK                          0x00000080
#define _PORTA_RA7_LENGTH                        0x00000001

#define _PORTA_RA8_POSITION                      0x00000008
#define _PORTA_RA8_MASK                          0x00000100
#define _PORTA_RA8_LENGTH                        0x00000001

#define _PORTA_RA9_POSITION                      0x00000009
#define _PORTA_RA9_MASK                          0x00000200
#define _PORTA_RA9_LENGTH                        0x00000001

#define _PORTA_RA10_POSITION                     0x0000000A
#define _PORTA_RA10_MASK                         0x00000400
#define _PORTA_RA10_LENGTH                       0x00000001

