MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F16KM204/mcu.h
#define _CTMUCON1L_ITRIM5_POSITION               0x00000007
#define _CTMUCON1L_ITRIM5_MASK                   0x00000080
#define _CTMUCON1L_ITRIM5_LENGTH                 0x00000001

#define _CTMUCON1H_EDG2SEL_POSITION              0x00000002
#define _CTMUCON1H_EDG2SEL_MASK                  0x0000003C
#define _CTMUCON1H_EDG2SEL_LENGTH                0x00000004

#define _CTMUCON1H_EDG2POL_POSITION              0x00000006
#define _CTMUCON1H_EDG2POL_MASK                  0x00000040
#define _CTMUCON1H_EDG2POL_LENGTH                0x00000001

#define _CTMUCON1H_EDG2MOD_POSITION              0x00000007
#define _CTMUCON1H_EDG2MOD_MASK                  0x00000080
#define _CTMUCON1H_EDG2MOD_LENGTH                0x00000001

#define _CTMUCON1H_EDG1STAT_POSITION             0x00000008
#define _CTMUCON1H_EDG1STAT_MASK                 0x00000100
#define _CTMUCON1H_EDG1STAT_LENGTH               0x00000001

#define _CTMUCON1H_EDG2STAT_POSITION             0x00000009
#define _CTMUCON1H_EDG2STAT_MASK                 0x00000200
#define _CTMUCON1H_EDG2STAT_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL_POSITION              0x0000000A
#define _CTMUCON1H_EDG1SEL_MASK                  0x00003C00
#define _CTMUCON1H_EDG1SEL_LENGTH                0x00000004

#define _CTMUCON1H_EDG1POL_POSITION              0x0000000E
#define _CTMUCON1H_EDG1POL_MASK                  0x00004000
#define _CTMUCON1H_EDG1POL_LENGTH                0x00000001

#define _CTMUCON1H_EDG1MOD_POSITION              0x0000000F
#define _CTMUCON1H_EDG1MOD_MASK                  0x00008000
#define _CTMUCON1H_EDG1MOD_LENGTH                0x00000001

#define _CTMUCON1H_EDG2SEL0_POSITION             0x00000002
#define _CTMUCON1H_EDG2SEL0_MASK                 0x00000004
#define _CTMUCON1H_EDG2SEL0_LENGTH               0x00000001

#define _CTMUCON1H_EDG2SEL1_POSITION             0x00000003
#define _CTMUCON1H_EDG2SEL1_MASK                 0x00000008
#define _CTMUCON1H_EDG2SEL1_LENGTH               0x00000001

#define _CTMUCON1H_EDG2SEL2_POSITION             0x00000004
#define _CTMUCON1H_EDG2SEL2_MASK                 0x00000010
#define _CTMUCON1H_EDG2SEL2_LENGTH               0x00000001

#define _CTMUCON1H_EDG2SEL3_POSITION             0x00000005
#define _CTMUCON1H_EDG2SEL3_MASK                 0x00000020
#define _CTMUCON1H_EDG2SEL3_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL0_POSITION             0x0000000A
#define _CTMUCON1H_EDG1SEL0_MASK                 0x00000400
#define _CTMUCON1H_EDG1SEL0_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL1_POSITION             0x0000000B
#define _CTMUCON1H_EDG1SEL1_MASK                 0x00000800
#define _CTMUCON1H_EDG1SEL1_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL2_POSITION             0x0000000C
#define _CTMUCON1H_EDG1SEL2_MASK                 0x00001000
#define _CTMUCON1H_EDG1SEL2_LENGTH               0x00000001

#define _CTMUCON1H_EDG1SEL3_POSITION             0x0000000D
#define _CTMUCON1H_EDG1SEL3_MASK                 0x00002000
#define _CTMUCON1H_EDG1SEL3_LENGTH               0x00000001

#define _CTMUCON2_DISCHS_POSITION                0x00000000
#define _CTMUCON2_DISCHS_MASK                    0x00000007
#define _CTMUCON2_DISCHS_LENGTH                  0x00000003

#define _CTMUCON2_IRSTEN_POSITION                0x00000004
#define _CTMUCON2_IRSTEN_MASK                    0x00000010
#define _CTMUCON2_IRSTEN_LENGTH                  0x00000001

#define _CTMUCON2_DISCHS0_POSITION               0x00000000
#define _CTMUCON2_DISCHS0_MASK                   0x00000001
#define _CTMUCON2_DISCHS0_LENGTH                 0x00000001

#define _CTMUCON2_DISCHS1_POSITION               0x00000001
#define _CTMUCON2_DISCHS1_MASK                   0x00000002
#define _CTMUCON2_DISCHS1_LENGTH                 0x00000001

#define _CTMUCON2_DISCHS2_POSITION               0x00000002
#define _CTMUCON2_DISCHS2_MASK                   0x00000004
#define _CTMUCON2_DISCHS2_LENGTH                 0x00000001

#define _CTMUCON2L_DISCHS_POSITION               0x00000000
#define _CTMUCON2L_DISCHS_MASK                   0x00000007
#define _CTMUCON2L_DISCHS_LENGTH                 0x00000003

#define _CTMUCON2L_IRSTEN_POSITION               0x00000004
#define _CTMUCON2L_IRSTEN_MASK                   0x00000010
#define _CTMUCON2L_IRSTEN_LENGTH                 0x00000001

#define _CTMUCON2L_DISCHS0_POSITION              0x00000000
#define _CTMUCON2L_DISCHS0_MASK                  0x00000001
#define _CTMUCON2L_DISCHS0_LENGTH                0x00000001

#define _CTMUCON2L_DISCHS1_POSITION              0x00000001
#define _CTMUCON2L_DISCHS1_MASK                  0x00000002
#define _CTMUCON2L_DISCHS1_LENGTH                0x00000001

#define _CTMUCON2L_DISCHS2_POSITION              0x00000002
#define _CTMUCON2L_DISCHS2_MASK                  0x00000004
#define _CTMUCON2L_DISCHS2_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN16_POSITION              0x00000000
#define _AD1CTMENH_CTMEN16_MASK                  0x00000001
#define _AD1CTMENH_CTMEN16_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN17_POSITION              0x00000001
#define _AD1CTMENH_CTMEN17_MASK                  0x00000002
#define _AD1CTMENH_CTMEN17_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN18_POSITION              0x00000002
#define _AD1CTMENH_CTMEN18_MASK                  0x00000004
#define _AD1CTMENH_CTMEN18_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN19_POSITION              0x00000003
#define _AD1CTMENH_CTMEN19_MASK                  0x00000008
#define _AD1CTMENH_CTMEN19_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN20_POSITION              0x00000004
#define _AD1CTMENH_CTMEN20_MASK                  0x00000010
#define _AD1CTMENH_CTMEN20_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN21_POSITION              0x00000005
#define _AD1CTMENH_CTMEN21_MASK                  0x00000020
#define _AD1CTMENH_CTMEN21_LENGTH                0x00000001

#define _AD1CTMENH_CTMEN22_POSITION              0x00000006
#define _AD1CTMENH_CTMEN22_MASK                  0x00000040
#define _AD1CTMENH_CTMEN22_LENGTH                0x00000001

